Reports/АнализТоваровИПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>АнализТоваровИПоставщиков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/ПроверкаКачестваТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПроверкаКачестваТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаданиеЛаборатории</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АК_РассылкиПоставщикамТехнологам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппыПоказателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПовторнойПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрикрепления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавилПротокол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеЛаборатории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтветаСРасширением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаСРасширением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лаборатория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылкаОбОтсутствииОтветаПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделанаРассылка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЖурналаПроверкиКачестваТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсследования_Удалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипИсследованияПоказателейКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросмотреноПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетОбязательногоОтветаПроизводителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтбораОбразца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваОбразца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураОбразца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельИсследования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеСтандартыИТехническиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатИсследования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарушение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МаркерыДляАудита</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыИсследований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипИсследованияПоказателейКачества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОрганолептическиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребованияПоНД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизикоХимическиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормативныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГосударственныеСтандартыИТехническиеУсловия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребованияПоНД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыПроизводителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АнализТоваровИПоставщиков/Forms/ФормаРасшифровка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Тип = "Жалобы" Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНач", Параметры.ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", Параметры.ДатаКон);
		Запрос.УстановитьПараметр("Товар", Параметры.Товар);
		Запрос.УстановитьПараметр("ЕстьОтборПоТовару", ЗначениеЗаполнено(Параметры.Товар));
		Запрос.УстановитьПараметр("Производитель", Параметры.Поставщик);
		Запрос.УстановитьПараметр("ЕстьОтборПоПроизводителю", ЗначениеЗаполнено(Параметры.Поставщик));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбращенияПокупателей.ДатаДок КАК ДатаДок,
		               |	ОбращенияПокупателей.ТипОбращения,
		               |	ОбращенияПокупателей.Производитель,
		               |	ОбращенияПокупателей.Номенклатура,
		               |	ОбращенияПокупателей.ТипЖалобы,
		               |	ОбращенияПокупателей.ИсточникОбращения,
		               |	ОбращенияПокупателей.Примечание,
		               |	ОбращенияПокупателей.ОтветПокупателю,
		               |	ОбращенияПокупателей.id_OK,
		               |	ОбращенияПокупателей.GUID_Загрузки
		               |ИЗ
		               |	РегистрСведений.ОбращенияПокупателей КАК ОбращенияПокупателей
		               |ГДЕ
		               |	ОбращенияПокупателей.ДатаДок МЕЖДУ &ДатаНач И &ДатаКон
		               |	И (ОбращенияПокупателей.Номенклатура = &Товар
		               |			ИЛИ &ЕстьОтборПоТовару = ЛОЖЬ)
		               |	И (ВЫБОР
		               |				КОГДА ОбращенияПокупателей.Производитель.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |					ТОГДА ОбращенияПокупателей.Производитель.ГоловнойКонтрагент
		               |				ИНАЧЕ ОбращенияПокупателей.Производитель
		               |			КОНЕЦ = &Производитель
		               |			ИЛИ &ЕстьОтборПоПроизводителю = ЛОЖЬ)
		               |	И ОбращенияПокупателей.ТипЖалобы.СчитатьЖалобойНаТовар = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДатаДок";
					   
		Выборка = Запрос.Выполнить().Выбрать(); 
		Макет = Отчеты.АнализТоваровИПоставщиков.ПолучитьМакет("ЖалобыРасшифровка");
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.ДатаНач = Формат(Запрос.Параметры.ДатаНач, "ДФ=dd.MM.yy");
		Область.Параметры.ДатаКон = Формат(Запрос.Параметры.ДатаКон, "ДФ=dd.MM.yy");
		ТабДокумент.Вывести(Область);
		Пока Выборка.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Дата = Формат(Выборка.ДатаДок, "ДФ=dd.MM.yy");
			Область.Параметры.ТипЖалобы = Выборка.ТипЖалобы;
			Область.Параметры.Товар = Выборка.Номенклатура;
			Область.Параметры.Поставщик = Выборка.Производитель;
			Область.Параметры.Источник = Выборка.ИсточникОбращения;
			Область.Параметры.Суть = Выборка.Примечание;
			Область.Параметры.Ответ = Выборка.ОтветПокупателю;
			Область.Параметры.Ключ = РегистрыСведений.ОбращенияПокупателей.СоздатьКлючЗаписи(Новый Структура("id_OK, GUID_Загрузки, ДатаДок", Выборка.id_OK, Выборка.GUID_Загрузки, Выборка.ДатаДок));
			ТабДокумент.Вывести(Область);
		КонецЦикла;
	ИначеЕсли Параметры.Тип = "Включения" Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНач", Параметры.ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", Параметры.ДатаКон);
		Запрос.УстановитьПараметр("Товар", Параметры.Товар);
		Запрос.УстановитьПараметр("ЕстьОтборПоТовару", ЗначениеЗаполнено(Параметры.Товар));
		Запрос.УстановитьПараметр("Производитель", Параметры.Поставщик);
		Запрос.УстановитьПараметр("ЕстьОтборПоПроизводителю", ЗначениеЗаполнено(Параметры.Поставщик));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбращенияПокупателей.ДатаДок КАК ДатаДок,
		               |	ОбращенияПокупателей.ТипОбращения,
		               |	ОбращенияПокупателей.Производитель,
		               |	ОбращенияПокупателей.Номенклатура,
		               |	ОбращенияПокупателей.ТипЖалобы,
		               |	ОбращенияПокупателей.ИсточникОбращения,
		               |	ОбращенияПокупателей.Примечание,
		               |	ОбращенияПокупателей.ОтветПокупателю,
		               |	ОбращенияПокупателей.id_OK,
		               |	ОбращенияПокупателей.GUID_Загрузки
		               |ИЗ
		               |	РегистрСведений.ОбращенияПокупателей КАК ОбращенияПокупателей
		               |ГДЕ
		               |	ОбращенияПокупателей.ДатаДок МЕЖДУ &ДатаНач И &ДатаКон
		               |	И (ОбращенияПокупателей.Номенклатура = &Товар
		               |			ИЛИ &ЕстьОтборПоТовару = ЛОЖЬ)
		               |	И (ВЫБОР
		               |				КОГДА ОбращенияПокупателей.Производитель.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |					ТОГДА ОбращенияПокупателей.Производитель.ГоловнойКонтрагент
		               |				ИНАЧЕ ОбращенияПокупателей.Производитель
		               |			КОНЕЦ = &Производитель
		               |			ИЛИ &ЕстьОтборПоПроизводителю = ЛОЖЬ)
		               |	И ОбращенияПокупателей.ТипЖалобы.СчитатьЖалобойНаТовар = ИСТИНА
		               |	И ОбращенияПокупателей.ТипЖалобы.ЭтоВключениеВПродукт = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДатаДок";
					   
		Выборка = Запрос.Выполнить().Выбрать(); 
		Макет = Отчеты.АнализТоваровИПоставщиков.ПолучитьМакет("ЖалобыРасшифровка");
		Область = Макет.ПолучитьОбласть("Шапка1");
		Область.Параметры.ДатаНач = Формат(Запрос.Параметры.ДатаНач, "ДФ=dd.MM.yy");
		Область.Параметры.ДатаКон = Формат(Запрос.Параметры.ДатаКон, "ДФ=dd.MM.yy");
		ТабДокумент.Вывести(Область);
		Пока Выборка.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Дата = Формат(Выборка.ДатаДок, "ДФ=dd.MM.yy");
			Область.Параметры.ТипЖалобы = Выборка.ТипЖалобы;
			Область.Параметры.Товар = Выборка.Номенклатура;
			Область.Параметры.Поставщик = Выборка.Производитель;
			Область.Параметры.Источник = Выборка.ИсточникОбращения;
			Область.Параметры.Суть = Выборка.Примечание;
			Область.Параметры.Ответ = Выборка.ОтветПокупателю;
			Область.Параметры.Ключ = РегистрыСведений.ОбращенияПокупателей.СоздатьКлючЗаписи(Новый Структура("id_OK, GUID_Загрузки, ДатаДок", Выборка.id_OK, Выборка.GUID_Загрузки, Выборка.ДатаДок));
			ТабДокумент.Вывести(Область);
		КонецЦикла;	
	ИначеЕсли Параметры.Тип = "Нарушения" Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ДатаНач", Параметры.ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", Параметры.ДатаКон);
		Запрос.УстановитьПараметр("Товар", Параметры.Товар);
		Запрос.УстановитьПараметр("ЕстьОтборПоТовару", ЗначениеЗаполнено(Параметры.Товар));
		Запрос.УстановитьПараметр("Производитель", Параметры.Поставщик);
		Запрос.УстановитьПараметр("ЕстьОтборПоПроизводителю", ЗначениеЗаполнено(Параметры.Поставщик));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Номенклатура,
		               |	ВЫБОР
		               |		КОГДА ЗначенияСвойствОбъектов.Значение.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |			ТОГДА ЗначенияСвойствОбъектов.Значение.ГоловнойКонтрагент
		               |		ИНАЧЕ ЗначенияСвойствОбъектов.Значение
		               |	КОНЕЦ КАК Поставщик,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Дата,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Показатель,
		               |	ПроверкаКачестваТоваровСоставПоказателей.НормаОт,
		               |	ПроверкаКачестваТоваровСоставПоказателей.НормаДо,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Результат,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Нарушение,
		               |	ПроверкаКачестваТоваровСоставПоказателей.Ссылка
		               |ИЗ
		               |	Документ.ПроверкаКачестваТоваров.СоставПоказателей КАК ПроверкаКачестваТоваровСоставПоказателей
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		               |		ПО ПроверкаКачестваТоваровСоставПоказателей.Ссылка.ХарактеристикаНоменклатуры = ЗначенияСвойствОбъектов.Объект
		               |			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель))
		               |ГДЕ
		               |	ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Проведен = ИСТИНА
		               |	И ПроверкаКачестваТоваровСоставПоказателей.Нарушение = ИСТИНА
		               |	И (ВЫБОР
		               |				КОГДА ЗначенияСвойствОбъектов.Значение.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |					ТОГДА ЗначенияСвойствОбъектов.Значение.ГоловнойКонтрагент
		               |				ИНАЧЕ ЗначенияСвойствОбъектов.Значение
		               |			КОНЕЦ = &Производитель
		               |			ИЛИ &ЕстьОтборПоПроизводителю = ЛОЖЬ)
		               |	И (ПроверкаКачестваТоваровСоставПоказателей.Ссылка.Номенклатура = &Товар
		               |			ИЛИ &ЕстьОтборПоТовару = ЛОЖЬ)";
					   
		Выборка = Запрос.Выполнить().Выбрать();
		Макет = Отчеты.АнализТоваровИПоставщиков.ПолучитьМакет("НарушенияРасшифровка");
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.ДатаНач = Формат(Запрос.Параметры.ДатаНач, "ДФ=dd.MM.yy");
		Область.Параметры.ДатаКон = Формат(Запрос.Параметры.ДатаКон, "ДФ=dd.MM.yy");
		ТабДокумент.Вывести(Область);
		Пока Выборка.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(Область);
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("РегистрСведенийКлючЗаписи.ОбращенияПокупателей") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("РегистрСведений.ОбращенияПокупателей.ФормаЗаписи", Новый Структура("Ключ", Расшифровка));
	КонецЕсли;	
	
КонецПроцедуры
